553 7635
8362 324
233 92
8595 261
65532 226
7841 331
1076 419
89 73
29356 449
322 166
178 193
20096 480
9760 316
8773 375
34 87
9472 196
123 309
30000 373
966 305
212 555
9794 263
1055 542
68 44
301 174
9650 243
1610 516
246 128
8231 360
1089 365
102 21
335 553
945 234
191 199
3618 362
47 64
1500 416
225 115
81 76
314 105
12480 312
170 183
7778 506
259 294
1102 532
115 12
204 229
60 40
293 147
1513 414
7901 361
382 248
1602 411
238 218
94 134
1081 538
937 265
183 202
39 52
272 308
361 552
217 178
1060 420
73 41
306 157
916 241
8901 485
162 188
772 300
251 224
8236 215
49436 433
107 26
196 217
12362 352
52 62
8736 402
230 195
8592 302
86 57
30340 445
9668 298
319 136
175 198
26481 456
120 53
8482 491
353 207
9702 168
28023 451
963 314
209 204
8804 236
65 32
298 163
8660 490
1607 517
243 138
1086 347
99 16
2306 515
332 268
942 547
188 155
34013 390
26494 455
44 25
1497 525
7885 502
8728 357
222 315
20140 477
21360 472
78 36
23567 464
311 160
921 549
167 154
1099 533
112 20
61607 101
345 275
955 270
201 206
1044 544
57 60
290 124
379 428
8364 116
31243 393
235 137
7843 505
91 94
324 232
934 281
34382 438
180 141
3607 410
36 85
269 212
1489 528
7877 406
9474 219
125 287
20043 481
1578 381
21496 471
214 240
1057 421
70 43
303 129
913 425
8288 208
7911 498
769 385
248 167
104 14
21619 470
337 336
947 327
193 257
49 51
32599 392
227 110
8212 317
83 28
316 153
926 334
20844 476
172 182
261 372
117 18
350 319
8712 376
960 244
206 223
8801 356
62 39
295 162
25991 351
7903 288
8746 340
1604 380
8369 404
240 98
8225 303
8835 486
21378 397
1083 417
96 74
185 172
41 72
8869 355
363 242
219 246
75 66
308 119
918 424
164 120
774 427
253 249
7861 503
109 19
8704 358
952 231
7717 507
198 299
54 65
287 256
39746 434
2350 514
21281 474
8594 118
232 121
8217 88
12398 482
1075 228
88 83
321 97
931 333
22823 468
7929 494
177 170
33 75
8251 264
122 56
355 369
1575 521
211 328
31452 441
67 35
300 159
245 286
27915 452
31109 337
8230 493
9827 296
7853 504
1088 535
101 5
28381 374
190 190
20108 478
46 27
279 386
8730 201
1588 412
601 550
224 123
80 29
313 175
923 548
28216 450
7921 497
169 89
779 426
402 277
21307 473
114 11
347 191
8709 489
957 383
203 283
30690 444
1046 543
59 84
292 131
1512 415
381 301
237 112
1080 247
7845 407
93 95
9675 225
936 423
182 186
38 77
23383 465
7879 342
12293 484
1580 520
593 551
216 152
1059 540
72 48
305 109
915 349
36947 436
61656 106
161 158
8756 339
250 200
1093 345
29750 446
106 55
339 251
26412 457
949 306
195 126
51 59
27721 453
373 429
1593 364
229 169
1072 289
3656 408
85 69
24184 462
318 150
928 348
7926 495
174 99
263 237
7871 343
119 22
352 220
208 161
64 103
297 135
24773 461
1606 363
33457 439
242 233
9824 297
98 23
187 177
20105 479
43 100
12531 310
1585 519
3648 508
77 42
310 143
920 292
22812 469
166 173
776 216
255 554
8240 341
31119 442
9837 295
111 8
8706 377
954 546
200 388
21338 398
56 67
289 430
1509 523
7897 378
12311 329
378 293
234 189
8596 359
1077 382
90 81
323 164
50872 432
22825 467
20851 475
33394 391
179 187
35 80
268 269
1488 344
124 78
357 368
967 422
213 387
1056 541
69 37
302 139
3585 512
247 273
9829 130
1090 346
103 17
946 259
9774 260
48 45
281 280
26354 458
1501 524
7889 501
226 102
12392 483
82 33
315 132
7923 496
171 205
1103 531
116 7
205 276
8800 254
3632 511
61 104
294 156
12460 313
1514 522
8745 291
22885 466
239 122
8224 214
1082 418
95 82
20013 399
328 370
184 111
417 307
40 71
273 371
1493 526
972 545
218 253
1061 539
74 70
307 133
163 96
9135 400
9601 4
252 114
8237 227
9834 239
108 13
951 384
197 210
61692 271
807 335
1040 304
53 61
375 290
21513 396
231 127
8593 211
1074 221
87 46
320 197
176 113
23665 463
1108 529
121 24
964 366
61472 322
210 556
9792 323
8805 258
3637 409
66 38
299 179
9737 354
1608 379
8373 492
244 144
1087 536
100 15
333 203
189 185
45 47
38750 435
8729 222
367 367
1587 413
223 213
79 34
25165 460
312 165
29579 448
168 142
778 230
2375 513
257 209
9839 353
113 58
346 320
956 238
12512 311
202 266
58 63
291 146
7899 499
380 235
236 148
92 108
9674 285
181 192
8776 250
37 90
1490 527
126 93
969 279
215 125
3642 509
71 50
304 140
160 91
249 245
29749 447
1092 534
105 9
948 332
194 181
50 54
283 262
38899 389
7891 500
8734 267
228 145
84 30
317 194
35828 437
262 272
8857 401
1105 530
118 31
351 255
8713 488
961 326
207 282
25903 459
3634 510
63 79
296 184
8658 284
27589 454
9734 176
8747 487
61503 321
1605 518
31859 440
241 117
1084 537
97 6
24052 395
186 180
42 86
275 431
8260 107
7883 405
220 252
30707 443
76 49
26149 394
9658 151
309 171
165 149
254 350
110 10
8472 403
29233 338
199 274
432 318
1042 325
55 68
61550 278
12310 330
4 6 557
9 10 558
4 7 559
14 5 560
4 8 561
4 12 562
11 5 563
559 560 564
5 11 565
6 10 566
4 23 567
558 17 568
4 22 569
9 7 570
8 10 571
6 7 572
4 16 573
4 20 574
13 5 575
6 11 576
9 12 577
8 11 578
561 21 579
10 15 580
5 12 581
6 13 582
4 21 583
11 8 584
4 558 585
5 10 586
4 30 587
16 26 588
4 19 589
4 28 590
4 35 591
561 10 592
4 32 593
557 580 594
5 15 595
9 13 596
6 12 597
14 8 598
9 16 599
4 15 600
18 12 601
9 571 602
11 6 603
34 36 604
4 38 605
4 29 606
4 17 607
8 19 608
37 33 609
609 28 610
610 604 611
29 611 612
40 612 613
613 39 614
13 8 615
9 11 616
9 17 617
4 577 618
7 8 619
5 7 620
4 41 621
13 6 622
18 11 623
12 25 624
4 42 625
4 614 626
9 19 627
4 43 628
6 17 629
5 13 630
4 14 631
559 8 632
570 14 633
4 44 634
9 15 635
8 13 636
4 46 637
569 633 638
18 7 639
4 48 640
562 7 641
16 7 642
587 560 643
8 7 644
572 602 645
18 10 646
566 15 647
6 15 648
7 565 649
570 5 650
4 49 651
582 13 652
4 13 653
4 33 654
31 5 655
4 50 656
16 14 657
569 14 658
16 5 659
4 5 660
7 11 661
559 14 662
6 19 663
617 14 664
4 10 665
18 580 666
8 22 667
557 10 668
563 12 669
8 15 670
565 12 671
596 13 672
6 588 673
629 5 674
557 7 675
4 34 676
5 5 677
586 7 678
4 627 679
6 23 680
6 20 681
658 650 682
15 568 683
598 619 684
621 10 685
4 563 686
569 5 687
7 568 688
584 666 689
601 661 690
18 19 691
557 563 692
583 578 693
6 558 694
6 24 695
18 13 696
664 7 697
566 7 698
18 563 699
8 12 700
576 15 701
30 560 702
4 47 703
589 566 704
690 645 705
31 565 706
4 584 707
567 5 708
616 7 709
4 36 710
18 5 711
4 37 712
635 5 713
573 566 714
6 26 715
622 588 716
4 598 717
17 5 718
617 10 719
18 20 720
4 672 721
5 22 722
560 11 723
4 24 724
721 705 725
562 677 726
615 22 727
626 25 728
564 563 729
581 25 730
12 27 731
567 673 732
562 14 733
58 18 734
11 9 735
52 12 736
574 684 737
662 577 738
4 575 739
573 14 740
8 670 741
573 8 742
8 26 743
563 5 744
4 57 745
597 12 746
567 716 747
17 689 748
4 54 749
20 14 750
9 21 751
20 575 752
558 15 753
572 5 754
562 26 755
679 674 756
590 7 757
4 31 758
584 19 759
5 19 760
577 7 761
576 7 762
567 8 763
4 615 764
13 711 765
11 7 766
680 575 767
572 565 768
578 7 769
4 560 770
4 51 771
581 7 772
732 748 773
4 11 774
5 642 775
581 12 776
562 619 777
558 5 778
18 596 779
563 586 780
6 616 781
567 24 782
53 7 783
574 13 784
669 12 785
571 7 786
9 20 787
570 24 788
5 16 789
45 45 790
4 26 791
12 7 792
583 759 793
608 5 794
10 5 795
576 26 796
562 570 797
567 765 798
561 11 799
21 21 800
581 719 801
6 575 802
22 10 803
13 24 804
591 14 805
599 7 806
779 683 807
23 8 808
9 31 809
13 13 810
601 5 811
8 646 812
5 576 813
797 688 814
777 588 815
4 66 816
18 15 817
8 17 818
18 17 819
12 5 820
9 5 821
574 584 822
5 6 823
4 55 824
567 807 825
686 15 826
8 623 827
573 576 828
13 15 829
558 7 830
576 568 831
671 571 832
16 560 833
587 14 834
622 24 835
608 566 836
562 20 837
4 570 838
597 7 839
636 578 840
583 11 841
607 780 842
569 652 843
4 70 844
4 71 845
593 766 846
13 746 847
563 15 848
45 51 849
687 831 850
9 655 851
603 750 852
575 12 853
572 595 854
559 603 855
22 8 856
641 647 857
715 5 858
6 31 859
733 709 860
593 10 861
4 69 862
559 767 863
806 699 864
573 615 865
8 18 866
24 25 867
5 8 868
574 832 869
571 5 870
21 7 871
648 5 872
7 24 873
562 598 874
868 752 875
562 713 876
5 572 877
9 26 878
7 575 879
7 14 880
577 14 881
629 581 882
566 17 883
9 575 884
571 17 885
569 836 886
558 26 887
599 5 888
662 572 889
584 803 890
601 7 891
23 565 892
755 24 893
9 566 894
574 8 895
600 785 896
6 596 897
5 783 898
19 678 899
18 23 900
569 768 901
654 8 902
20 7 903
606 684 904
4 73 905
857 568 906
9 588 907
9 6 908
583 8 909
9 581 910
749 849 911
6 659 912
557 12 913
602 582 914
591 8 915
597 14 916
563 620 917
582 26 918
631 647 919
574 875 920
632 20 921
634 801 922
573 840 923
17 852 924
562 794 925
4 622 926
572 568 927
562 19 928
14 709 929
571 15 930
6 657 931
9 563 932
616 13 933
700 7 934
6 16 935
22 568 936
679 882 937
667 10 938
9 56 939
753 667 940
24 575 941
559 563 942
694 688 943
584 608 944
8 578 945
573 608 946
653 697 947
717 13 948
561 639 949
7 694 950
4 603 951
574 864 952
563 10 953
660 19 954
559 856 955
557 13 956
630 727 957
11 24 958
20 20 959
562 16 960
680 24 961
623 568 962
567 890 963
587 8 964
607 11 965
562 22 966
590 20 967
631 597 968
649 10 969
597 5 970
569 940 971
605 8 972
698 12 973
562 719 974
567 595 975
948 683 976
64 790 977
9 722 978
9 582 979
589 8 980
642 602 981
589 872 982
18 570 983
566 12 984
19 565 985
628 578 986
707 608 987
681 565 988
4 655 989
16 8 990
676 10 991
578 26 992
841 786 993
595 683 994
19 5 995
630 15 996
569 741 997
573 571 998
6 655 999
24 582 1000
4 734 1001
572 14 1002
896 595 1003
567 644 1004
591 576 1005
636 15 1006
599 14 1007
5 20 1008
6 27 1009
734 558 1010
4 720 1011
724 957 1012
21 776 1013
4 59 1014
7 5 1015
574 835 1016
9 996 1017
578 10 1018
834 577 1019
795 1010 1020
704 1020 1021
9 8 1022
1013 914 1023
663 5 1024
23 575 1025
567 11 1026
562 8 1027
40 64 1028
22 39 1029
1028 1029 1030
576 718 1031
562 10 1032
822 1023 1033
819 14 1034
878 5 1035
583 744 1036
641 917 1037
596 15 1038
566 718 1039
642 578 1040
669 7 1041
631 664 1042
567 961 1043
581 27 1044
600 801 1045
724 866 1046
646 10 1047
6 563 1048
640 8 1049
637 14 1050
568 25 1051
789 578 1052
630 13 1053
559 744 1054
1000 873 1055
627 582 1056
607 603 1057
569 560 1058
5 597 1059
563 572 1060
574 943 1061
557 11 1062
13 647 1063
593 580 1064
576 24 1065
808 701 1066
52 52 1067
812 950 1068
600 962 1069
916 602 1070
640 5 1071
566 16 1072
590 16 1073
74 74 1074
676 21 1075
578 15 1076
599 582 1077
559 11 1078
55 9 1079
700 649 1080
764 743 1081
600 603 1082
566 659 1083
578 829 1084
707 1055 1085
774 697 1086
583 727 1087
660 575 1088
12 713 1089
11 570 1090
14 753 1091
20 17 1092
573 572 1093
607 847 1094
27 7 1095
12 12 1096
55 775 1097
590 598 1098
567 601 1099
615 578 1100
16 575 1101
27 55 1102
1102 1092 1103
11 830 1104
1095 783 1105
631 577 1106
567 639 1107
660 53 1108
619 571 1109
592 5 1110
4 586 1111
8 1079 1112
954 1112 1113
737 924 1114
4 77 1115
8 31 1116
13 566 1117
582 788 1118
18 588 1119
928 652 1120
557 766 1121
16 16 1122
5 580 1123
7 595 1124
7 571 1125
15 695 1126
607 933 1127
4 76 1128
6 642 1129
775 578 1130
600 818 1131
707 648 1132
591 608 1133
739 871 1134
627 5 1135
641 941 1136
11 761 1137
605 823 1138
586 659 1139
583 1017 1140
653 1031 1141
561 706 1142
574 762 1143
562 623 1144
578 19 1145
770 648 1146
658 1007 1147
562 560 1148
4 723 1149
855 558 1150
724 827 1151
5 586 1152
809 568 1153
572 619 1154
7 723 1155
637 652 1156
31 630 1157
673 620 1158
771 60 1159
607 689 1160
5 23 1161
583 722 1162
5 575 1163
9 578 1164
586 12 1165
965 746 1166
784 754 1167
758 978 1168
11 599 1169
740 781 1170
593 7 1171
760 802 1172
590 8 1173
23 652 1174
1001 1118 1175
22 695 1176
570 833 1177
593 11 1178
623 10 1179
654 5 1180
681 5 1181
570 927 1182
846 25 1183
569 918 1184
20 565 1185
676 639 1186
628 1070 1187
643 563 1188
751 5 1189
679 1182 1190
20 5 1191
572 657 1192
559 898 1193
751 696 1194
865 817 1195
616 15 1196
942 581 1197
639 1194 1198
651 8 1199
590 14 1200
712 10 1201
605 716 1202
587 603 1203
1032 667 1204
708 1091 1205
30 14 1206
1177 10 1207
19 566 1208
557 810 1209
607 584 1210
8 563 1211
569 597 1212
710 722 1213
773 27 1214
583 1100 1215
557 808 1216
605 5 1217
562 646 1218
997 586 1219
579 21 1220
589 1068 1221
19 597 1222
625 566 1223
1050 650 1224
663 20 1225
565 1009 1226
696 13 1227
639 5 1228
574 796 1229
966 5 1230
576 12 1231
830 674 1232
937 977 1233
637 994 1234
1049 811 1235
621 12 1236
571 12 1237
583 1172 1238
634 603 1239
4 1074 1240
5 24 1241
17 8 1242
691 23 1243
1154 8 1244
740 627 1245
605 11 1246
665 813 1247
665 722 1248
620 582 1249
565 10 1250
591 32 1251
21 5 1252
1137 1222 1253
6 25 1254
621 7 1255
561 1155 1256
561 23 1257
587 47 1258
745 1130 1259
812 17 1260
568 12 1261
9 23 1262
1004 7 1263
619 20 1264
27 702 1265
558 581 1266
1245 1226 1267
6 56 1268
4 78 1269
701 586 1270
4 601 1271
4 646 1272
27 32 1273
659 903 1274
24 1101 1275
557 616 1276
649 1164 1277
4 62 1278
946 20 1279
596 568 1280
578 24 1281
600 577 1282
706 24 1283
1128 18 1284
590 26 1285
20 988 1286
557 15 1287
665 5 1288
573 786 1289
600 945 1290
636 575 1291
8 20 1292
18 669 1293
19 20 1294
810 705 1295
621 15 1296
799 1039 1297
763 701 1298
576 19 1299
606 584 1300
583 622 1301
631 572 1302
902 608 1303
563 663 1304
622 659 1305
862 10 1306
31 586 1307
589 802 1308
621 580 1309
665 898 1310
1230 768 1311
9 730 1312
575 15 1313
600 8 1314
583 741 1315
30 41 1316
645 582 1317
12 929 1318
696 7 1319
565 21 1320
717 811 1321
637 1084 1322
20 586 1323
824 1158 1324
31 678 1325
784 566 1326
9 691 1327
18 16 1328
4 56 1329
895 575 1330
634 785 1331
639 14 1332
4 52 1333
12 8 1334
586 10 1335
577 5 1336
12 20 1337
763 24 1338
600 938 1339
600 5 1340
608 586 1341
574 887 1342
1057 24 1343
557 21 1344
1047 24 1345
565 25 1346
9 53 1347
691 892 1348
17 620 1349
589 644 1350
605 673 1351
1316 604 1352
584 22 1353
9 603 1354
640 644 1355
922 25 1356
1144 21 1357
572 723 1358
577 990 1359
573 560 1360
989 1040 1361
564 616 1362
1206 577 1363
696 15 1364
20 24 1365
1263 608 1366
12 16 1367
1251 29 1368
763 743 1369
631 999 1370
1352 28 1371
570 602 1372
1371 977 1373
1368 1373 1374
634 1052 1375
631 781 1376
5 663 1377
764 16 1378
596 706 1379
54 45 1380
572 969 1381
563 24 1382
625 576 1383
1296 1059 1384
13 599 1385
573 681 1386
1002 944 1387
703 47 1388
670 1250 1389
570 879 1390
8 571 1391
14 599 1392
591 566 1393
565 27 1394
15 945 1395
7 12 1396
590 19 1397
586 649 1398
598 636 1399
569 992 1400
631 578 1401
577 12 1402
676 11 1403
588 12 1404
4 666 1405
1088 750 1406
600 796 1407
621 1295 1408
717 995 1409
1114 24 1410
1257 1097 1411
587 1244 1412
4 61 1413
606 1104 1414
1210 720 1415
737 12 1416
909 1041 1417
597 26 1418
1016 568 1419
828 1109 1420
603 19 1421
18 800 1422
628 11 1423
28 929 1424
583 13 1425
21 570 1426
805 1253 1427
15 575 1428
893 27 1429
565 24 1430
4 790 1431
1184 568 1432
1258 1424 1433
651 5 1434
58 711 1435
603 871 1436
712 53 1437
1354 800 1438
606 1080 1439
653 778 1440
635 568 1441
621 19 1442
566 26 1443
634 577 1444
559 623 1445
573 788 1446
565 31 1447
795 24 1448
640 794 1449
1072 1359 1450
600 695 1451
874 22 1452
904 924 1453
584 1034 1454
18 582 1455
596 24 1456
589 5 1457
708 931 1458
563 19 1459
739 7 1460
1062 19 1461
565 624 1462
859 581 1463
637 5 1464
4 669 1465
601 14 1466
584 1096 1467
622 16 1468
591 571 1469
21 696 1470
569 598 1471
699 25 1472
784 698 1473
558 582 1474
589 1249 1475
636 13 1476
708 6 1477
665 644 1478
709 14 1479
1355 630 1480
665 697 1481
653 885 1482
562 620 1483
564 19 1484
593 13 1485
24 19 1486
607 1438 1487
12 14 1488
667 13 1489
678 12 1490
1087 671 1491
654 595 1492
616 792 1493
20 769 1494
717 7 1495
763 53 1496
770 13 1497
562 566 1498
1405 565 1499
576 1129 1500
583 877 1501
558 776 1502
791 10 1503
715 568 1504
700 5 1505
1335 577 1506
585 619 1507
574 973 1508
1406 698 1509
625 1116 1510
838 12 1511
606 762 1512
652 24 1513
632 22 1514
763 572 1515
861 1056 1516
587 11 1517
558 10 1518
740 1038 1519
16 13 1520
953 7 1521
567 629 1522
635 12 1523
561 829 1524
1239 936 1525
15 18 1526
956 1334 1527
653 1035 1528
841 1450 1529
568 27 1530
742 615 1531
745 1232 1532
735 20 1533
591 847 1534
1082 936 1535
1058 563 1536
606 13 1537
985 599 1538
593 15 1539
597 24 1540
24 12 1541
573 13 1542
569 672 1543
591 615 1544
569 1090 1545
691 985 1546
634 695 1547
833 12 1548
1284 644 1549
569 994 1550
1479 1126 1551
623 582 1552
558 649 1553
661 24 1554
572 578 1555
625 5 1556
14 870 1557
578 16 1558
11 568 1559
575 7 1560
636 854 1561
1195 12 1562
1107 1125 1563
586 17 1564
27 28 1565
634 5 1566
607 8 1567
567 1196 1568
574 988 1569
637 633 1570
635 1428 1571
606 943 1572
691 20 1573
567 586 1574
620 12 1575
1201 17 1576
1022 601 1577
20 835 1578
586 16 1579
605 595 1580
600 581 1581
654 789 1582
557 689 1583
1460 649 1584
573 623 1585
6 9 1586
824 5 1587
8 21 1588
561 1323 1589
593 20 1590
644 723 1591
557 17 1592
573 575 1593
574 623 1594
567 652 1595
567 970 1596
1445 879 1597
18 657 1598
769 14 1599
724 1260 1600
559 1506 1601
6 623 1602
23 11 1603
800 677 1604
606 864 1605
603 20 1606
1378 854 1607
572 581 1608
12 620 1609
628 8 1610
646 26 1611
865 588 1612
660 24 1613
605 765 1614
635 718 1615
653 1153 1616
749 45 1617
587 856 1618
626 27 1619
7 586 1620
583 932 1621
665 1348 1622
6 22 1623
755 709 1624
1081 568 1625
1487 5 1626
656 933 1627
1301 17 1628
583 1139 1629
989 1392 1630
47 15 1631
623 24 1632
593 810 1633
27 27 1634
563 13 1635
704 24 1636
9 678 1637
591 560 1638
562 647 1639
9 565 1640
853 12 1641
606 796 1642
6 21 1643
791 1207 1644
1329 1161 1645
20 13 1646
562 983 1647
668 1056 1648
601 599 1649
32 10 1650
573 701 1651
657 650 1652
562 1379 1653
1652 642 1654
764 1242 1655
5 25 1656
757 941 1657
607 1006 1658
654 581 1659
607 18 1660
591 840 1661
670 630 1662
19 620 1663
575 5 1664
939 56 1665
41 10 1666
559 652 1667
4 65 1668
663 1456 1669
735 588 1670
733 769 1671
567 1489 1672
603 570 1673
565 7 1674
615 17 1675
905 866 1676
774 1441 1677
1291 981 1678
589 586 1679
665 8 1680
600 1052 1681
626 736 1682
656 1270 1683
558 568 1684
742 646 1685
696 576 1686
607 1382 1687
1587 984 1688
567 566 1689
769 1673 1690
859 24 1691
972 743 1692
560 15 1693
662 1454 1694
8 601 1695
13 778 1696
593 1538 1697
573 1398 1698
574 1080 1699
619 588 1700
593 616 1701
573 720 1702
735 31 1703
9 1025 1704
563 7 1705
11 578 1706
1216 639 1707
4 599 1708
607 1024 1709
843 27 1710
607 615 1711
603 642 1712
4 81 1713
1138 1198 1714
686 16 1715
602 12 1716
739 17 1717
724 813 1718
7 560 1719
1401 820 1720
1529 25 1721
1156 1286 1722
574 1320 1723
9 1435 1724
645 25 1725
584 20 1726
662 744 1727
562 5 1728
644 14 1729
4 68 1730
739 1358 1731
591 788 1732
686 21 1733
980 563 1734
597 649 1735
605 576 1736
647 1367 1737
1558 1275 1738
27 614 1739
911 60 1740
18 53 1741
631 883 1742
634 818 1743
625 24 1744
1004 879 1745
640 636 1746
589 1571 1747
581 5 1748
557 959 1749
567 563 1750
739 1463 1751
751 7 1752
762 899 1753
708 576 1754
574 1381 1755
4 80 1756
11 887 1757
598 17 1758
23 23 1759
567 572 1760
637 741 1761
583 912 1762
1582 787 1763
934 691 1764
838 27 1765
635 695 1766
1186 1426 1767
562 734 1768
599 12 1769
558 12 1770
582 880 1771
589 24 1772
677 20 1773
24 27 1774
591 572 1775
863 27 1776
656 18 1777
590 22 1778
930 571 1779
1397 652 1780
640 781 1781
589 858 1782
19 568 1783
23 12 1784
558 9 1785
573 5 1786
1216 655 1787
574 694 1788
567 1387 1789
676 800 1790
833 15 1791
15 24 1792
1078 1119 1793
939 5 1794
590 929 1795
1018 568 1796
1187 25 1797
605 772 1798
681 1365 1799
630 12 1800
656 11 1801
659 566 1802
591 13 1803
573 598 1804
22 992 1805
710 8 1806
656 780 1807
692 6 1808
4 595 1809
1289 694 1810
1645 603 1811
670 24 1812
651 1779 1813
640 647 1814
606 11 1815
590 560 1816
660 576 1817
756 25 1818
52 7 1819
755 754 1820
583 1493 1821
677 26 1822
926 20 1823
1574 657 1824
1113 27 1825
605 1551 1826
720 575 1827
17 17 1828
16 571 1829
653 1390 1830
570 582 1831
22 741 1832
603 995 1833
1326 5 1834
1087 565 1835
564 820 1836
715 581 1837
574 1665 1838
608 620 1839
637 768 1840
22 13 1841
710 5 1842
574 934 1843
618 1561 1844
557 20 1845
676 829 1846
606 1117 1847
11 571 1848
4 67 1849
1592 694 1850
4 1243 1851
816 1207 1852
751 1252 1853
585 1089 1854
787 12 1855
735 1123 1856
884 7 1857
675 7 1858
8 8 1859
573 663 1860
567 13 1861
685 1277 1862
564 24 1863
574 1104 1864
561 623 1865
590 5 1866
1179 570 1867
641 817 1868
947 12 1869
1098 22 1870
781 12 1871
1344 649 1872
583 804 1873
1534 599 1874
596 622 1875
1631 938 1876
1477 1198 1877
19 12 1878
573 858 1879
1138 657 1880
1596 1174 1881
1634 27 1882
574 575 1883
701 12 1884
629 575 1885
839 599 1886
771 45 1887
644 12 1888
648 667 1889
784 973 1890
51 60 1891
17 566 1892
559 1135 1893
966 877 1894
567 576 1895
31 581 1896
8 16 1897
9 706 1898
1580 944 1899
567 620 1900
578 12 1901
628 727 1902
582 6 1903
582 575 1904
646 657 1905
639 565 1906
4 713 1907
821 659 1908
1563 1876 1909
641 907 1910
28 7 1911
4 60 1912
651 818 1913
809 671 1914
569 1084 1915
949 1089 1916
1444 1448 1917
891 608 1918
614 25 1919
645 12 1920
960 780 1921
567 617 1922
557 19 1923
22 918 1924
1495 630 1925
1229 595 1926
616 1706 1927
4 735 1928
11 18 1929
572 851 1930
1635 622 1931
649 12 1932
569 1341 1933
5 630 1934
29 684 1935
574 636 1936
1199 655 1937
628 13 1938
1500 565 1939
570 595 1940
975 12 1941
651 697 1942
5 620 1943
576 6 1944
1486 23 1945
707 588 1946
1060 851 1947
617 5 1948
21 1145 1949
680 558 1950
686 648 1951
559 584 1952
593 21 1953
603 24 1954
12 661 1955
606 8 1956
24 13 1957
1823 1264 1958
998 1274 1959
26 5 1960
1850 792 1961
574 1557 1962
13 851 1963
4 9 1964
15 718 1965
1163 1603 1966
1073 1399 1967
1602 698 1968
655 848 1969
641 1533 1970
581 713 1971
907 586 1972
628 741 1973
625 586 1974
1945 636 1975
646 17 1976
1178 1654 1977
742 706 1978
1630 575 1979
1853 1521 1980
617 1474 1981
8 25 1982
8 24 1983
758 577 1984
656 1006 1985
598 811 1986
632 1857 1987
24 20 1988
591 1228 1989
572 699 1990
17 571 1991
562 6 1992
567 772 1993
757 917 1994
909 644 1995
1016 565 1996
1531 848 1997
1071 563 1998
1418 620 1999
1742 568 2000
787 20 2001
1005 1109 2002
8 23 2003
628 1345 2004
582 12 2005
1549 730 2006
625 1389 2007
720 565 2008
580 565 2009
582 19 2010
13 627 2011
770 563 2012
1838 6 2013
596 19 2014
1351 748 2015
1193 699 2016
1708 571 2017
1384 25 2018
1510 821 2019
712 575 2020
591 812 2021
811 691 2022
623 12 2023
667 565 2024
1497 1663 2025
1581 26 2026
710 1599 2027
574 644 2028
956 885 2029
589 1796 2030
582 727 2031
569 1192 2032
1203 1157 2033
1350 1738 2034
641 576 2035
750 870 2036
571 581 2037
51 45 2038
773 25 2039
589 934 2040
573 667 2041
691 566 2042
607 620 2043
16 636 2044
593 12 2045
1851 1931 2046
620 1015 2047
1594 752 2048
27 35 2049
574 669 2050
1122 776 2051
4 835 2052
16 681 2053
9 620 2054
644 5 2055
1697 566 2056
22 1152 2057
869 12 2058
658 884 2059
625 595 2060
561 1963 2061
1737 1181 2062
911 67 2063
587 563 2064
600 761 2065
640 664 2066
757 576 2067
1337 616 2068
806 1293 2069
18 558 2070
742 623 2071
640 761 2072
1883 854 2073
707 1588 2074
1111 17 2075
631 672 2076
1282 1578 2077
20 973 2078
562 1447 2079
627 752 2080
561 1841 2081
743 568 2082
24 15 2083
809 582 2084
742 1604 2085
606 576 2086
47 1318 2087
651 1153 2088
1047 568 2089
1894 2078 2090
13 697 2091
15 570 2092
583 1833 2093
567 615 2094
16 723 2095
635 565 2096
630 24 2097
681 566 2098
895 830 2099
573 1018 2100
660 1885 2101
4 1041 2102
942 1044 2103
905 827 2104
733 1181 2105
909 53 2106
586 5 2107
61 45 2108
796 620 2109
628 570 2110
983 576 2111
605 961 2112
10 7 2113
660 1325 2114
82 2053 2115
569 695 2116
569 1076 2117
964 20 2118
923 27 2119
1664 655 2120
593 19 2121
23 5 2122
755 9 2123
589 1927 2124
634 796 2125
625 858 2126
590 10 2127
589 571 2128
573 563 2129
1873 568 2130
819 576 2131
926 1294 2132
559 2087 2133
607 1270 2134
837 912 2135
919 12 2136
31 595 2137
942 730 2138
4 1283 2139
800 599 2140
591 1764 2141
971 12 2142
1820 1066 2143
640 667 2144
9 663 2145
651 1189 2146
816 10 2147
665 1691 2148
959 595 2149
557 16 2150
589 695 2151
559 5 2152
637 1341 2153
640 565 2154
725 702 2155
628 912 2156
9 1139 2157
589 576 2158
676 795 2159
559 1377 2160
625 644 2161
574 566 2162
562 823 2163
585 1520 2164
1501 962 2165
1133 20 2166
600 1980 2167
1564 2070 2168
574 563 2169
31 730 2170
715 586 2171
1900 2057 2172
625 1649 2173
589 812 2174
565 6 2175
562 1546 2176
717 22 2177
558 16 2178
876 1924 2179
825 12 2180
574 700 2181
708 1948 2182
824 891 2183
660 931 2184
686 19 2185
573 639 2186
745 5 2187
1148 13 2188
1442 674 2189
1271 595 2190
742 1969 2191
567 1670 2192
558 6 2193
771 67 2194
969 1391 2195
1279 1906 2196
573 616 2197
852 599 2198
1605 624 2199
668 24 2200
589 595 2201
573 11 2202
623 17 2203
644 7 2204
880 568 2205
588 620 2206
567 1035 2207
6 14 2208
749 790 2209
598 18 2210
589 599 2211
4 689 2212
635 678 2213
20 1117 2214
567 582 2215
606 832 2216
569 1553 2217
1099 1502 2218
5 848 2219
620 657 2220
965 597 2221
583 1227 2222
572 1552 2223
859 568 2224
1763 730 2225
980 31 2226
576 10 2227
656 1024 2228
1733 575 2229
628 744 2230
687 563 2231
742 1827 2232
693 19 2233
590 620 2234
2044 754 2235
21 1211 2236
1593 576 2237
35 14 2238
764 655 2239
20 578 2240
17 24 2241
775 602 2242
605 807 2243
1461 657 2244
628 1867 2245
1081 12 2246
605 563 2247
757 817 2248
1786 1280 2249
21 881 2250
625 629 2251
596 727 2252
637 836 2253
1344 2195 2254
1309 894 2255
769 12 2256
6 55 2257
1545 1620 2258
791 1241 2259
605 601 2260
4 63 2261
562 13 2262
572 8 2263
1526 642 2264
561 1802 2265
8 639 2266
635 581 2267
704 736 2268
590 1700 2269
770 1965 2270
574 2168 2271
566 6 2272
2092 914 2273
928 1280 2274
1186 1395 2275
589 1389 2276
567 584 2277
578 582 2278
713 8 2279
2031 1152 2280
1613 5 2281
834 572 2282
860 25 2283
1617 1380 2284
45 12 2285
587 744 2286
756 27 2287
787 5 2288
1108 20 2289
582 21 2290
1767 624 2291
651 885 2292
31 597 2293
1271 568 2294
560 10 2295
596 2210 2296
1058 630 2297
629 571 2298
573 1304 2299
559 2171 2300
656 1060 2301
573 847 2302
865 820 2303
1459 821 2304
909 563 2305
574 1468 2306
1078 984 2307
562 877 2308
566 24 2309
587 767 2310
617 565 2311
573 6 2312
2270 1758 2313
2174 1124 2314
1412 624 2315
583 1669 2316
1059 571 2317
1288 595 2318
2304 563 2319
669 14 2320
770 762 2321
908 25 2322
590 823 2323
16 563 2324
54 849 2325
601 12 2326
843 1286 2327
725 32 2328
567 1971 2329
1132 27 2330
937 64 2331
574 1908 2332
915 636 2333
708 586 2334
600 6 2335
951 558 2336
953 657 2337
706 7 2338
710 897 2339
874 936 2340
946 19 2341
557 31 2342
4 888 2343
628 698 2344
1133 599 2345
905 813 2346
565 19 2347
605 629 2348
764 7 2349
637 576 2350
1907 597 2351
625 760 2352
560 12 2353
20 620 2354
911 68 2355
656 8 2356
607 1060 2357
1952 601 2358
1218 1609 2359
559 897 2360
862 20 2361
668 1591 2362
599 1275 2363
630 21 2364
708 568 2365
585 15 2366
574 1305 2367
847 581 2368
16 1436 2369
589 629 2370
591 1436 2371
1453 24 2372
562 789 2373
4 25 2374
583 827 2375
975 944 2376
1685 649 2377
20 12 2378
825 27 2379
31 671 2380
844 2098 2381
24 23 2382
686 20 2383
596 570 2384
10 565 2385
47 21 2386
18 981 2387
1357 912 2388
717 829 2389
570 657 2390
656 663 2391
690 582 2392
562 1975 2393
13 568 2394
1288 588 2395
1953 1169 2396
59 45 2397
1094 581 2398
9 595 2399
54 61 2400
9 848 2401
762 14 2402
24 568 2403
660 580 2404
1519 953 2405
958 568 2406
784 1886 2407
1173 1332 2408
1741 1632 2409
65 45 2410
695 12 2411
751 599 2412
577 602 2413
1425 572 2414
1913 8 2415
631 627 2416
605 603 2417
593 22 2418
24 792 2419
660 1283 2420
562 887 2421
591 786 2422
591 701 2423
559 22 2424
939 595 2425
634 8 2426
590 646 2427
1512 24 2428
27 38 2429
6 53 2430
895 20 2431
596 1313 2432
654 1898 2433
573 1467 2434
1058 10 2435
623 657 2436
901 27 2437
5 595 2438
572 12 2439
5 715 2440
665 1505 2441
606 14 2442
1236 1063 2443
574 746 2444
582 7 2445
2214 5 2446
587 48 2447
660 1828 2448
791 650 2449
600 709 2450
23 792 2451
640 2280 2452
606 875 2453
573 1678 2454
1302 25 2455
590 661 2456
1026 566 2457
844 722 2458
2071 7 2459
1469 1274 2460
606 1381 2461
844 1158 2462
23 24 2463
904 63 2464
696 903 2465
772 2084 2466
591 858 2467
2358 671 2468
565 910 2469
559 735 2470
6 1791 2471
54 62 2472
607 741 2473
573 1947 2474
574 11 2475
710 1317 2476
2296 2047 2477
733 1889 2478
725 27 2479
841 983 2480
1026 697 2481
605 1387 2482
583 935 2483
1148 1008 2484
902 588 2485
583 652 2486
639 24 2487
641 870 2488
571 24 2489
636 21 2490
1545 568 2491
1723 1145 2492
2382 1944 2493
591 1678 2494
596 26 2495
816 568 2496
18 581 2497
1170 12 2498
1386 2493 2499
567 1999 2500
1349 723 2501
620 897 2502
574 781 2503
949 1395 2504
20 1305 2505
648 1327 2506
657 10 2507
9 25 2508
606 835 2509
567 603 2510
641 603 2511
606 636 2512
710 697 2513
31 596 2514
590 719 2515
632 2501 2516
51 67 2517
573 584 2518
637 772 2519
640 578 2520
560 563 2521
637 992 2522
712 15 2523
18 584 2524
2451 1712 2525
620 584 2526
653 1189 2527
23 578 2528
600 1757 2529
761 12 2530
877 723 2531
1005 624 2532
589 681 2533
626 72 2534
874 581 2535
565 16 2536
862 28 2537
1160 27 2538
1860 2175 2539
559 598 2540
740 1972 2541
572 711 2542
1287 15 2543
570 568 2544
1026 1615 2545
593 2392 2546
2419 760 2547
605 617 2548
1711 2170 2549
562 720 2550
591 720 2551
1088 642 2552
745 978 2553
557 642 2554
653 761 2555
583 881 2556
900 1385 2557
592 804 2558
805 1038 2559
1266 5 2560
662 566 2561
4 811 2562
855 2140 2563
1722 25 2564
954 20 2565
643 820 2566
589 1662 2567
1788 1124 2568
626 702 2569
1117 26 2570
600 571 2571
625 695 2572
1453 867 2573
1255 582 2574
771 54 2575
567 1812 2576
562 568 2577
615 20 2578
656 741 2579
574 617 2580
607 2111 2581
577 19 2582
685 2068 2583
573 1950 2584
804 1832 2585
795 588 2586
625 1068 2587
686 7 2588
828 12 2589
816 1523 2590
960 1399 2591
691 10 2592
1375 25 2593
571 25 2594
10 663 2595
2244 1871 2596
1517 1119 2597
1071 1771 2598
658 572 2599
576 17 2600
760 678 2601
606 694 2602
919 575 2603
1349 767 2604
602 25 2605
1178 19 2606
4 27 2607
605 572 2608
569 1038 2609
2100 565 2610
51 61 2611
1452 12 2612
593 563 2613
671 27 2614
605 639 2615
751 21 2616
569 778 2617
4 650 2618
640 608 2619
779 7 2620
616 571 2621
895 636 2622
972 53 2623
617 1831 2624
62 45 2625
636 558 2626
1576 1063 2627
16 1637 2628
565 1208 2629
562 1152 2630
837 789 2631
591 598 2632
583 558 2633
15 565 2634
1579 596 2635
16 970 2636
559 760 2637
628 1299 2638
1217 1091 2639
586 565 2640
18 659 2641
563 648 2642
566 5 2643
54 67 2644
31 978 2645
911 65 2646
1411 12 2647
646 5 2648
54 60 2649
809 581 2650
651 6 2651
589 760 2652
573 1228 2653
11 1336 2654
36 50 2655
606 1468 2656
1768 1048 2657
691 678 2658
900 1025 2659
663 752 2660
902 648 2661
583 1070 2662
1199 743 2663
558 24 2664
26 558 2665
959 568 2666
647 6 2667
628 932 2668
628 759 2669
758 1232 2670
561 803 2671
590 1546 2672
739 1643 2673
59 68 2674
774 2089 2675
1357 1066 2676
558 659 2677
1928 706 2678
12 598 2679
839 575 2680
656 584 2681
923 1470 2682
1790 888 2683
570 12 2684
625 2022 2685
1488 787 2686
630 7 2687
1276 2446 2688
819 17 2689
708 2236 2690
2331 1318 2691
2115 1103 2692
2691 2692 2693
2072 578 2694
593 16 2695
904 624 2696
651 858 2697
59 61 2698
2306 595 2699
1364 565 2700
1858 2471 2701
27 29 2702
1585 950 2703
16 840 2704
822 1097 2705
559 823 2706
899 12 2707
660 927 2708
583 646 2709
587 5 2710
13 881 2711
653 1266 2712
964 24 2713
600 735 2714
606 887 2715
16 6 2716
634 1304 2717
629 730 2718
2065 1083 2719
593 642 2720
12 702 2721
640 576 2722
664 688 2723
777 20 2724
54 68 2725
634 945 2726
9 853 2727
605 1090 2728
699 15 2729
590 734 2730
1723 775 2731
2050 678 2732
1970 595 2733
59 67 2734
676 706 2735
742 743 2736
573 1966 2737
41 19 2738
1809 718 2739
1659 769 2740
758 566 2741
597 595 2742
57 1130 2743
628 1100 2744
600 630 2745
21 839 2746
590 983 2747
575 1008 2748
591 681 2749
892 958 2750
569 8 2751
574 576 2752
866 1025 2753
651 1031 2754
59 65 2755
2305 748 2756
674 25 2757
559 884 2758
1268 568 2759
573 1053 2760
1300 1097 2761
2102 1968 2762
10 581 2763
715 2746 2764
574 839 2765
634 581 2766
1014 15 2767
758 970 2768
1514 565 2769
837 1559 2770
2344 1540 2771
606 572 2772
959 565 2773
1218 17 2774
757 907 2775
589 891 2776
606 669 2777
706 582 2778
51 68 2779
625 8 2780
15 5 2781
26 1241 2782
593 959 2783
951 596 2784
1597 2586 2785
2324 1015 2786
13 565 2787
625 681 2788
758 576 2789
808 743 2790
1220 888 2791
656 1752 2792
1082 803 2793
628 2014 2794
565 655 2795
651 1390 2796
559 821 2797
784 572 2798
24 701 2799
569 1053 2800
1331 730 2801
590 2008 2802
14 568 2803
1360 588 2804
577 23 2805
774 646 2806
640 44 2807
606 644 2808
33 8 2809
574 572 2810
559 1163 2811
10 776 2812
1393 2293 2813
680 1169 2814
905 957 2815
20 673 2816
791 1523 2817
56 5 2818
562 1839 2819
2384 1065 2820
55 1983 2821
1590 1753 2822
59 62 2823
31 568 2824
23 644 2825
569 6 2826
1861 623 2827
761 599 2828
605 584 2829
6 635 2830
4 727 2831
639 602 2832
583 1856 2833
11 698 2834
605 24 2835
855 588 2836
2260 1502 2837
54 65 2838
575 24 2839
626 32 2840
27 42 2841
926 1792 2842
27 43 2843
931 18 2844
51 65 2845
2221 731 2846
636 9 2847
16 979 2848
2188 21 2849
591 623 2850
558 595 2851
1610 644 2852
931 778 2853
727 568 2854
648 568 2855
587 760 2856
653 647 2857
23 667 2858
566 568 2859
656 603 2860
577 1693 2861
625 1662 2862
573 582 2863
59 60 2864
51 62 2865
791 8 2866
998 12 2867
587 827 2868
574 2252 2869
922 624 2870
967 912 2871
575 624 2872
590 802 2873
605 890 2874
617 699 2875
2145 930 2876
777 563 2877
578 910 2878
645 624 2879
870 24 2880
878 2844 2881
590 2120 2882
654 772 2883
589 558 2884
601 26 2885
1497 20 2886
573 900 2887
559 1244 2888
578 571 2889
607 13 2890
598 639 2891
591 1398 2892
10 17 2893
20 6 2894
799 1981 2895
639 699 2896
562 802 2897
627 1783 2898
565 568 2899
589 620 2900
640 2042 2901
4 83 2902
590 623 2903
660 1540 2904
2229 981 2905
855 1404 2906
700 12 2907
622 19 2908
861 1135 2909
14 663 2910
568 565 2911
640 1799 2912
18 26 2913
637 1553 2914
805 1939 2915
570 910 2916
605 1196 2917
660 1307 2918
590 2011 2919
630 804 2920
2052 568 2921
573 647 2922
1015 580 2923
628 2337 2924
1705 873 2925
2447 37 2926
795 715 2927
589 1504 2928
600 1008 2929
1437 20 2930
649 21 2931
1803 900 2932
2458 630 2933
625 1249 2934
946 752 2935
557 1122 2936
601 581 2937
1154 700 2938
590 1379 2939
12 32 2940
574 2881 2941
562 1024 2942
918 568 2943
1671 12 2944
569 753 2945
628 1669 2946
1133 19 2947
1215 27 2948
582 25 2949
628 2466 2950
2150 1467 2951
562 1794 2952
573 930 2953
742 572 2954
589 1785 2955
660 783 2956
567 2659 2957
1309 908 2958
560 648 2959
681 671 2960
771 61 2961
2774 2368 2962
634 789 2963
1071 762 2964
822 2264 2965
883 2626 2966
663 19 2967
574 2069 2968
742 2131 2969
1078 1611 2970
30 856 2971
1258 1318 2972
771 65 2973
574 2966 2974
911 61 2975
19 892 2976
578 979 2977
605 615 2978
902 1000 2979
740 1939 2980
587 898 2981
647 12 2982
625 558 2983
22 701 2984
2226 821 2985
639 12 2986
584 13 2987
585 1277 2988
587 1135 2989
591 597 2990
1306 1914 2991
10 630 2992
2524 1191 2993
605 582 2994
2032 568 2995
742 1598 2996
559 1179 2997
972 24 2998
12 581 2999
16 581 3000
2738 674 3001
591 678 3002
1377 1641 3003
589 1649 3004
46 14 3005
47 720 3006
1322 25 3007
18 24 3008
562 2080 3009
577 568 3010
1518 565 3011
631 648 3012
614 736 3013
2164 817 3014
855 1157 3015
805 2560 3016
1411 731 3017
628 622 3018
1285 24 3019
22 1007 3020
915 1604 3021
574 1002 3022
906 27 3023
587 823 3024
12 63 3025
73 1260 3026
1268 56 3027
9 734 3028
833 624 3029
35 576 3030
1516 624 3031
656 2629 3032
1759 570 3033
583 615 3034
883 576 3035
1815 2178 3036
651 620 3037
865 880 3038
559 566 3039
9 669 3040
591 663 3041
567 891 3042
574 565 3043
1977 1472 3044
569 1822 3045
596 788 3046
1306 1940 3047
631 2290 3048
652 1430 3049
589 694 3050
915 706 3051
637 940 3052
1717 12 3053
1531 623 3054
822 31 3055
645 27 3056
712 19 3057
771 51 3058
797 12 3059
599 581 3060
628 881 3061
574 5 3062
1126 25 3063
665 667 3064
698 674 3065
712 24 3066
23 647 3067
574 1690 3068
1537 698 3069
574 696 3070
744 26 3071
56 56 3072
591 1918 3073
960 2107 3074
980 1332 3075
11 596 3076
1353 15 3077
865 1719 3078
13 1189 3079
989 2604 3080
770 1771 3081
590 619 3082
1393 648 3083
573 678 3084
567 2363 3085
669 624 3086
1423 786 3087
1746 2585 3088
12 595 3089
590 566 3090
1331 581 3091
569 999 3092
751 1145 3093
619 803 3094
591 636 3095
637 1038 3096
586 661 3097
3035 1859 3098
606 620 3099
6 833 3100
685 969 3101
1034 7 3102
1801 647 3103
570 578 3104
953 659 3105
559 858 3106
606 1690 3107
779 15 3108
62 68 3109
1004 14 3110
572 599 3111
595 1792 3112
631 2083 3113
837 644 3114
62 67 3115
685 10 3116
1383 657 3117
573 636 3118
589 1192 3119
590 572 3120
1525 624 3121
16 601 3122
656 847 3123
1383 1157 3124
26 6 3125
1122 565 3126
1845 1753 3127
17 1606 3128
583 6 3129
1032 897 3130
2373 930 3131
745 1875 3132
707 22 3133
591 700 3134
1098 20 3135
838 736 3136
656 620 3137
2565 873 3138
10 1819 3139
11 601 3140
10 568 3141
743 5 3142
573 1918 3143
603 23 3144
574 582 3145
665 1024 3146
31 582 3147
1268 778 3148
31 2413 3149
562 900 3150
583 753 3151
566 27 3152
558 8 3153
1014 44 3154
791 635 3155
4 45 3156
584 7 3157
653 602 3158
583 2432 3159
651 700 3160
813 657 3161
1902 565 3162
1082 1991 3163
631 2224 3164
651 2062 3165
1804 2235 3166
23 566 3167
605 695 3168
665 1317 3169
874 7 3170
1369 12 3171
653 572 3172
696 24 3173
53 599 3174
755 2220 3175
2805 677 3176
641 2542 3177
1050 572 3178
583 2320 3179
1613 581 3180
587 623 3181
16 608 3182
1845 752 3183
35 8 3184
7 897 3185
606 582 3186
628 652 3187
1400 568 3188
791 3098 3189
560 7 3190
8 1675 3191
641 674 3192
651 2531 3193
42 566 3194
625 571 3195
1476 576 3196
24 853 3197
651 2409 3198
834 744 3199
587 735 3200
606 2319 3201
857 12 3202
2075 778 3203
734 620 3204
1746 1766 3205
575 25 3206
9 698 3207
822 7 3208
1303 25 3209
712 2993 3210
816 635 3211
569 582 3212
599 25 3213
758 3065 3214
1128 711 3215
1412 25 3216
641 1008 3217
654 1008 3218
2751 1364 3219
654 694 3220
771 62 3221
712 1325 3222
855 2273 3223
51 54 3224
641 11 3225
9 629 3226
1143 24 3227
1703 568 3228
951 15 3229
2819 2803 3230
1262 11 3231
562 582 3232
1243 671 3233
36 8 3234
574 823 3235
980 811 3236
61 68 3237
600 881 3238
1517 984 3239
1646 754 3240
2728 881 3241
1127 12 3242
861 7 3243
9 789 3244
1229 568 3245
874 5 3246
646 788 3247
2511 22 3248
2127 667 3249
651 648 3250
621 52 3251
686 13 3252
559 1988 3253
4 751 3254
32 810 3255
663 1695 3256
598 586 3257
558 25 3258
2086 577 3259
49 8 3260
574 673 3261
577 595 3262
559 570 3263
915 743 3264
653 2062 3265
605 13 3266
600 789 3267
735 581 3268
5 582 3269
1964 29 3270
574 2667 3271
62 60 3272
1516 12 3273
578 25 3274
771 68 3275
639 2592 3276
786 14 3277
1788 7 3278
61 60 3279
67 45 3280
1576 2711 3281
725 614 3282
637 1822 3283
1842 588 3284
21 6 3285
861 718 3286
686 17 3287
3257 1347 3288
655 2578 3289
707 2825 3290
897 767 3291
606 1320 3292
632 24 3293
591 578 3294
566 25 3295
1630 853 3296
651 778 3297
47 12 3298
568 624 3299
2259 1066 3300
606 988 3301
606 1292 3302
589 2109 3303
712 2402 3304
951 2206 3305
583 1299 3306
675 2923 3307
583 1421 3308
951 3033 3309
895 853 3310
710 644 3311
825 624 3312
622 56 3313
591 970 3314
967 1559 3315
1590 3076 3316
670 5 3317
998 2786 3318
760 892 3319
1337 2401 3320
874 20 3321
562 636 3322
886 736 3323
61 65 3324
776 1674 3325
1144 689 3326
1220 599 3327
589 572 3328
49 37 3329
919 27 3330
591 1291 3331
2381 1748 3332
591 575 3333
600 1684 3334
891 599 3335
2021 1554 3336
605 970 3337
2245 1472 3338
986 659 3339
590 794 3340
608 23 3341
1111 2821 3342
6 18 3343
640 741 3344
637 813 3345
607 576 3346
590 789 3347
1071 648 3348
1510 1312 3349
1235 25 3350
682 27 3351
2883 1968 3352
72 25 3353
800 775 3354
790 45 3355
628 1161 3356
787 624 3357
926 1960 3358
681 595 3359
805 1225 3360
20 8 3361
758 2279 3362
634 938 3363
1360 1748 3364
14 1262 3365
617 566 3366
27 44 3367
562 2317 3368
660 734 3369
2465 699 3370
948 1766 3371
625 1391 3372
632 623 3373
627 581 3374
631 701 3375
1032 858 3376
649 25 3377
859 578 3378
628 1493 3379
643 24 3380
1565 27 3381
735 903 3382
1200 769 3383
2240 1065 3384
625 1165 3385
37 53 3386
674 899 3387
569 698 3388
625 934 3389
845 32 3390
911 62 3391
712 13 3392
1648 12 3393
600 932 3394
47 47 3395
32 36 3396
771 59 3397
723 10 3398
586 820 3399
628 781 3400
792 941 3401
593 819 3402
593 808 3403
593 2051 3404
605 644 3405
570 688 3406
812 7 3407
2396 566 3408
757 1422 3409
707 810 3410
1750 648 3411
2211 584 3412
1503 667 3413
740 1253 3414
589 1319 3415
590 1794 3416
569 1606 3417
1176 12 3418
35 615 3419
843 25 3420
640 672 3421
8 27 3422
917 568 3423
583 1943 3424
567 2570 3425
2064 580 3426
24 16 3427
590 6 3428
637 1231 3429
591 6 3430
606 2069 3431
625 601 3432
824 1573 3433
640 652 3434
653 839 3435
631 1799 3436
1221 12 3437
585 31 3438
589 796 3439
589 601 3440
1213 12 3441
634 630 3442
1014 45 3443
641 735 3444
57 978 3445
589 1418 3446
2197 1101 3447
1621 2505 3448
631 761 3449
573 3077 3450
1549 581 3451
2866 1903 3452
827 659 3453
597 16 3454
828 2406 3455
627 20 3456
1685 1554 3457
4 85 3458
27 46 3459
679 20 3460
608 892 3461
606 769 3462
641 762 3463
1567 568 3464
1037 12 3465
884 15 3466
658 802 3467
16 1264 3468
2811 3149 3469
33 37 3470
591 827 3471
641 2506 3472
23 2203 3473
2245 699 3474
654 760 3475
569 932 3476
909 666 3477
2094 588 3478
585 21 3479
591 1966 3480
3468 601 3481
656 2198 3482
1866 903 3483
668 10 3484
715 730 3485
678 582 3486
562 2547 3487
1955 2387 3488
1136 27 3489
3097 582 3490
3113 2834 3491
1951 24 3492
591 1225 3493
733 787 3494
16 794 3495
591 1060 3496
570 2891 3497
2248 1022 3498
567 1551 3499
589 698 3500
1728 2778 3501
47 23 3502
565 603 3503
18 683 3504
1053 568 3505
23 584 3506
1984 1704 3507
62 65 3508
1715 2288 3509
1082 22 3510
18 642 3511
987 27 3512
1784 649 3513
590 720 3514
591 563 3515
11 786 3516
805 1500 3517
735 595 3518
883 575 3519
562 18 3520
559 1504 3521
641 673 3522
1660 24 3523
584 810 3524
61 67 3525
1218 2654 3526
559 3112 3527
2584 620 3528
618 1063 3529
573 1225 3530
1514 1884 3531
1180 582 3532
966 2898 3533
581 969 3534
38 716 3535
739 19 3536
828 2354 3537
574 672 3538
20 595 3539
2457 657 3540
695 25 3541
20 935 3542
844 2648 3543
1167 27 3544
693 26 3545
16 630 3546
656 1382 3547
740 694 3548
606 623 3549
2602 7 3550
1910 565 3551
591 584 3552
1026 647 3553
1236 1561 3554
750 2037 3555
600 2753 3556
805 599 3557
591 1950 3558
707 1404 3559
926 23 3560
824 2920 3561
725 28 3562
1718 12 3563
563 582 3564
710 2223 3565
11 867 3566
1868 1490 3567
34 10 3568
27 30 3569
559 681 3570
1442 882 3571
591 2680 3572
2681 720 3573
36 722 3574
862 66 3575
862 2009 3576
608 2263 3577
576 683 3578
972 701 3579
640 630 3580
574 14 3581
559 932 3582
844 3173 3583
791 570 3584
686 582 3585
567 647 3586
641 1934 3587
562 2748 3588
1639 3020 3589
717 670 3590
913 12 3591
1403 1981 3592
591 1467 3593
2518 2149 3594
1403 1039 3595
628 646 3596
2001 568 3597
905 1260 3598
32 33 3599
3036 776 3600
583 2014 3601
1525 25 3602
2656 581 3603
855 596 3604
615 706 3605
708 566 3606
1651 3366 3607
51 51 3608
587 22 3609
605 817 3610
662 1261 3611
2775 565 3612
583 636 3613
1658 586 3614
605 1812 3615
1977 699 3616
1501 1293 3617
717 19 3618
1544 2205 3619
606 563 3620
11 597 3621
699 624 3622
861 17 3623
660 572 3624
641 672 3625
2312 1252 3626
605 813 3627
1593 566 3628
635 582 3629
760 3384 3630
574 769 3631
625 819 3632
641 645 3633
573 1764 3634
590 1447 3635
617 1555 3636
587 57 3637
698 599 3638
589 2022 3639
733 11 3640
576 21 3641
27 48 3642
2931 804 3643
1768 635 3644
625 2109 3645
29 1690 3646
590 568 3647
593 17 3648
1777 713 3649
56 24 3650
764 3513 3651
583 584 3652
559 639 3653
653 2600 3654
1442 2718 3655
32 28 3656
631 2042 3657
1301 1783 3658
622 558 3659
627 754 3660
625 1785 3661
3070 3605 3662
668 17 3663
607 1752 3664
573 622 3665
574 907 3666
974 12 3667
585 792 3668
2694 867 3669
1657 25 3670
676 1802 3671
1239 1991 3672
802 2113 3673
27 49 3674
3128 723 3675
589 2967 3676
1985 586 3677
1054 27 3678
621 28 3679
1234 25 3680
570 9 3681
585 1395 3682
23 582 3683
559 1443 3684
1518 568 3685
661 806 3686
939 701 3687
799 1892 3688
24 1191 3689
2546 908 3690
605 630 3691
578 674 3692
1138 2487 3693
567 597 3694
567 2620 3695
591 1237 3696
634 1757 3697
583 623 3698
1350 723 3699
818 852 3700
1122 2847 3701
1402 602 3702
589 672 3703
758 671 3704
757 754 3705
1610 1041 3706
625 1591 3707
665 620 3708
572 7 3709
863 25 3710
1904 24 3711
3101 1317 3712
2520 820 3713
653 2403 3714
2507 3191 3715
1252 3105 3716
581 14 3717
606 673 3718
561 3481 3719
841 3176 3720
967 2256 3721
1726 1077 3722
1272 3093 3723
1556 3174 3724
600 644 3725
665 2223 3726
861 2628 3727
41 1295 3728
1159 68 3729
634 1476 3730
589 2853 3731
20 1165 3732
1660 772 3733
708 727 3734
1257 12 3735
662 887 3736
590 666 3737
587 31 3738
1439 624 3739
1073 2157 3740
625 2820 3741
2730 1048 3742
1210 936 3743
595 12 3744
663 597 3745
656 13 3746
11 582 3747
559 900 3748
13 558 3749
1320 696 3750
1839 1169 3751
3270 1557 3752
1062 1654 3753
1173 871 3754
576 9 3755
587 2938 3756
3244 581 3757
926 15 3758
661 1083 3759
41 73 3760
654 2526 3761
1159 60 3762
774 568 3763
665 897 3764
574 2635 3765
637 672 3766
52 563 3767
566 597 3768
2389 12 3769
770 829 3770
606 565 3771
562 2411 3772
1246 1615 3773
10 6 3774
2035 2250 3775
1761 586 3776
587 1377 3777
691 19 3778
1045 27 3779
654 2326 3780
641 1422 3781
574 2010 3782
2126 720 3783
663 599 3784
1117 2992 3785
635 595 3786
573 970 3787
572 563 3788
951 1280 3789
33 5 3790
589 877 3791
2072 1281 3792
742 1364 3793
574 586 3794
567 696 3795
1627 12 3796
2077 595 3797
2798 1949 3798
654 836 3799
3561 2250 3800
874 1364 3801
72 702 3802
558 645 3803
657 568 3804
637 598 3805
665 3233 3806
637 560 3807
2342 3291 3808
877 14 3809
1045 595 3810
4 809 3811
2164 3504 3812
644 1125 3813
596 697 3814
3226 1421 3815
562 2008 3816
632 803 3817
922 12 3818
28 20 3819
562 2477 3820
17 698 3821
991 1696 3822
598 670 3823
718 580 3824
2852 1174 3825
574 778 3826
1566 648 3827
573 1048 3828
17 1421 3829
600 11 3830
589 1347 3831
591 11 3832
590 713 3833
569 1463 3834
2033 25 3835
758 1875 3836
1203 558 3837
1477 706 3838
1180 17 3839
3344 821 3840
805 781 3841
1209 3636 3842
562 1008 3843
10 775 3844
844 891 3845
1203 596 3846
1992 2641 3847
600 2624 3848
1526 981 3849
590 582 3850
663 581 3851
956 3542 3852
3378 650 3853
1737 681 3854
1037 27 3855
53 24 3856
1750 2764 3857
1689 2385 3858
616 601 3859
2141 5 3860
1689 2272 3861
2054 24 3862
1121 761 3863
1255 736 3864
567 1002 3865
749 61 3866
615 1191 3867
1423 1766 3868
23 673 3869
8 1332 3870
574 1573 3871
590 647 3872
567 3461 3873
593 689 3874
2631 979 3875
561 596 3876
19 595 3877
837 2440 3878
6 800 3879
712 576 3880
2598 24 3881
2371 624 3882
557 1176 3883
951 588 3884
1314 568 3885
1048 13 3886
590 2080 3887
22 5 3888
718 25 3889
1246 647 3890
23 671 3891
1995 1174 3892
24 8 3893
595 25 3894
16 615 3895
59 1105 3896
593 31 3897
681 644 3898
607 818 3899
574 3288 3900
861 10 3901
1568 12 3902
3231 1065 3903
668 7 3904
577 649 3905
19 796 3906
1572 25 3907
745 2279 3908
641 694 3909
632 648 3910
805 2436 3911
1140 27 3912
837 1391 3913
1195 24 3914
18 1065 3915
637 1192 3916
899 25 3917
600 3228 3918
2302 599 3919
3419 820 3920
1340 588 3921
588 3185 3922
1503 1189 3923
574 759 3924
691 558 3925
967 769 3926
569 762 3927
561 1307 3928
620 25 3929
19 872 3930
632 1328 3931
791 1773 3932
2339 624 3933
576 25 3934
583 3785 3935
574 2024 3936
663 6 3937
573 597 3938
3676 1729 3939
967 616 3940
649 24 3941
18 622 3942
3500 577 3943
739 648 3944
592 1696 3945
2241 903 3946
923 12 3947
574 639 3948
1646 698 3949
595 27 3950
565 17 3951
676 1323 3952
660 630 3953
2720 809 3954
2442 596 3955
1584 12 3956
605 652 3957
18 718 3958
2262 888 3959
980 23 3960
641 1929 3961
1542 787 3962
954 18 3963
986 15 3964
3212 3140 3965
745 577 3966
1292 670 3967
742 636 3968
2121 2759 3969
16 776 3970
3961 642 3971
947 731 3972
590 636 3973
3927 1758 3974
5 27 3975
749 62 3976
3403 639 3977
3078 12 3978
772 3190 3979
687 1231 3980
558 688 3981
1423 1083 3982
641 781 3983
986 19 3984
15 586 3985
1027 3126 3986
629 711 3987
2277 3701 3988
618 3967 3989
1340 21 3990
915 839 3991
34 795 3992
771 790 3993
38 11 3994
816 1211 3995
768 979 3996
569 3497 3997
12 571 3998
583 2814 3999
1108 1185 4000
1123 565 4001
818 6 4002
587 938 4003
921 25 4004
2953 1372 4005
628 6 4006
600 2502 4007
686 2009 4008
2152 3898 4009
562 2120 4010
627 23 4011
27 50 4012
1643 620 4013
626 614 4014
31 24 4015
1351 2799 4016
8 644 4017
569 568 4018
777 655 4019
3027 8 4020
946 23 4021
758 935 4022
698 6 4023
653 570 4024
1897 648 4025
590 18 4026
628 1856 4027
21 1076 4028
31 2621 4029
2552 1169 4030
600 958 4031
1027 871 4032
1159 65 4033
3811 1281 4034
574 1192 4035
18 619 4036
2559 953 4037
634 586 4038
46 836 4039
15 608 4040
634 1684 4041
3215 586 4042
591 1947 4043
626 64 4044
3263 575 4045
3134 1578 4046
18 3072 4047
607 2198 4048
607 2640 4049
855 24 4050
583 570 4051
3030 1109 4052
574 648 4053
600 2885 4054
2597 624 4055
1956 636 4056
816 570 4057
949 1426 4058
3120 623 4059
1938 572 4060
590 877 4061
1025 19 4062
54 54 4063
712 839 4064
1403 1892 4065
920 27 4066
712 1294 4067
581 24 4068
1058 1800 4069
2609 3079 4070
1290 12 4071
569 620 4072
894 8 4073
1328 1348 4074
2618 1878 4075
648 595 4076
2444 1564 4077
2618 19 4078
1459 1327 4079
2161 1738 4080
888 25 4081
1016 671 4082
2391 730 4083
567 1905 4084
607 754 4085
965 647 4086
930 5 4087
862 12 4088
590 2317 4089
22 768 4090
88 12 4091
1340 31 4092
559 31 4093
14 6 4094
745 586 4095
1072 568 4096
1005 12 4097
712 1540 4098
3005 650 4099
952 25 4100
21 769 4101
593 1096 4102
715 565 4103
2776 3100 4104
38 823 4105
817 5 4106
785 595 4107
591 616 4108
1951 568 4109
656 938 4110
1689 10 4111
605 647 4112
2431 1686 4113
2128 3104 4114
640 572 4115
2588 584 4116
589 1598 4117
1473 624 4118
1098 730 4119
605 597 4120
1246 713 4121
572 608 4122
569 1299 4123
62 61 4124
712 1735 4125
2003 884 4126
559 3577 4127
559 2311 4128
625 670 4129
573 603 4130
837 775 4131
2162 630 4132
625 872 4133
1026 713 4134
710 620 4135
1457 620 4136
1263 853 4137
753 12 4138
911 59 4139
589 1837 4140
593 1307 4141
2583 1725 4142
1473 731 4143
47 20 4144
1146 3555 4145
1923 885 4146
1289 2987 4147
578 657 4148
2298 582 4149
22 813 4150
9 892 4151
585 12 4152
1899 25 4153
606 566 4154
1240 702 4155
2632 2235 4156
