name: "bert"
backend: "poplar"
max_batch_size: 32
input [
        {
                name: "input_0"
                data_type: TYPE_INT32
                dims: [ 384 ]
        },
        {
                name: "input_1"
                data_type: TYPE_INT32
                dims: [ 384 ]
        },
        {
                name: "input_2"
                data_type: TYPE_INT32
                dims: [ 384 ]
        }
]
output [
        {
                name: "output_0"
                data_type: TYPE_FP16
                dims: [ 384 ]
        },
        {
                name: "output_1"
                data_type: TYPE_FP16
                dims: [ 384 ]
        }
]

parameters [
        {
                key: "synchronous_execution"
                value:{string_value: "1"}
        },
        {
                key: "timeout_ns"
                value:{string_value: "500000"}
        }
]

instance_group [{ kind: KIND_CPU }]
